# Missing Data Handling

In [1]:
import pandas as pd

In [16]:
data = {
    "Name": ["Amir", "Ahmad", None, "Ali"],
    "Address": ["Tehran", "Tabriz", "Rasht", "Esfahan"],
    "Age": [19, 20, 24, None]
}
df = pd.DataFrame(data)
df

    Name  Address   Age
0   Amir   Tehran  19.0
1  Ahmad   Tabriz  20.0
2   None    Rasht  24.0
3    Ali  Esfahan   NaN

In [17]:
df.isnull()

    Name  Address    Age
0  False    False  False
1  False    False  False
2   True    False  False
3  False    False   True

In [18]:
df[(df['Age'].isnull()) | (df['Name'].isnull())]

   Name  Address   Age
2  None    Rasht  24.0
3   Ali  Esfahan   NaN

In [19]:
df.fillna('Something') # replace all null

        Name  Address        Age
0       Amir   Tehran         19
1      Ahmad   Tabriz         20
2  Something    Rasht         24
3        Ali  Esfahan  Something

In [20]:
# Replace by columns
new_df = df.copy()
new_df.Name = df.Name.fillna('Mammad')
new_df

     Name  Address   Age
0    Amir   Tehran  19.0
1   Ahmad   Tabriz  20.0
2  Mammad    Rasht  24.0
3     Ali  Esfahan   NaN

In [22]:
# pad
# replace null with the value of previous row
df.pad()

    Name  Address   Age
0   Amir   Tehran  19.0
1  Ahmad   Tabriz  20.0
2  Ahmad    Rasht  24.0
3    Ali  Esfahan  24.0

In [24]:
# pfill
# replace null with the row after
df.fillna(method='bfill')

    Name  Address   Age
0   Amir   Tehran  19.0
1  Ahmad   Tabriz  20.0
2    Ali    Rasht  24.0
3    Ali  Esfahan   NaN

In [28]:
# replace 
import numpy as np
# nulls should be treated as nan
new_df = df.copy()
new_df.Name = df.Name.replace(to_replace=np.nan, value="Mammad")
new_df

     Name  Address   Age
0    Amir   Tehran  19.0
1   Ahmad   Tabriz  20.0
2  Mammad    Rasht  24.0
3     Ali  Esfahan   NaN

## Drop Null

In [29]:
df

    Name  Address   Age
0   Amir   Tehran  19.0
1  Ahmad   Tabriz  20.0
2   None    Rasht  24.0
3    Ali  Esfahan   NaN

In [30]:
df.dropna()  # drop rows with null values

    Name Address   Age
0   Amir  Tehran  19.0
1  Ahmad  Tabriz  20.0

In [31]:
df.dropna(axis=1)  # drop columns with null values

   Address
0   Tehran
1   Tabriz
2    Rasht
3  Esfahan